package com.myhalf.controller.navigation;

import android.content.Context;
import android.net.Uri;
import android.os.Bundle;
import android.app.Fragment;
import android.support.annotation.Nullable;
import android.text.method.ScrollingMovementMethod;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import com.myhalf.R;

public class Takanon extends Fragment {

    public Takanon() {
        // Required empty public constructor
    }
    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        return inflater.inflate(R.layout.fragment_takanon, container, false);

    }

    @Override
    public void onActivityCreated(@Nullable Bundle savedInstanceState) {
        super.onActivityCreated(savedInstanceState);

        TextView txtDetails = getView().findViewById(R.id.txtDetails);
        txtDetails.setText("בהרשמתך לאפליקציית 'החצי שלי', הנך מאשר את ההוראות להלן, ומתחייב לעמוד בכל תנאי ההנהלה של האפליקציה. יש לציין שהוראת תקנון זה יגברו על כל פרסום או מודעה במידה ויהיו כאלה באפליקציה. במידה ואינך מסכים לסעיף כלשהו הנך מתבקש לא להירשם לאפליקציה או להשתמש בשירותיו. כל האמור בתקנון מנוסח מטעמי נוחות בלשון זכר, אך מכוון לגברים ונשים כאחד.\n" +
                "\n" +
                "1.\tידוע לך כי השירות הינו לצורך היכרות בלבד למטרת נישואין על פי/בהתאם להלכה היהודית. האפליקציה הינו אפליקציה המיועד ליהודים דתיים ושומרי מצוות ומסורת, והנך מתבקש לכבד את צביון האפליקציה ואת כבוד המשתמשים בו.\n" +
                "2.\tהנהלת החצי שלי רשאית לשנות את תנאי השירות בכל עת. אין ההנהלה מתחייבת להודיע זאת, אך ההנהלה תשתדל לפרסם הודעה על שינוי (אם יהיה) במערכת של האפליקציה.\n" +
                "3.\tהחצי שלי משאירה לעצמה את הזכות לאשר או לא לאשר כרטיסים מסוימים מסיבות השמורות עמה, על פי שיקול דעתה הבלעדי. כמו כן, החצי שלי משאירה לעצמה את הזכות לפסול לפי שיקול דעתה טקסט או חלק מטקסט שהוזן ע\"י משתמשים בכרטיסם באפליקציה, וכן, תמונות של משתמשים מטעמי צניעות או מכל טעם אחר. כמו כן, הנהלת החצי שלי שומרת לעצמה את האפשרות למחוק/להקפיא/לחסום כרטיסים או מידע מתוך כרטיסים מסוימים, לפי שיקול דעתה הבלעדי. פעולה זו עשויה לכלול נתוני כרטיסים או מידע בקשר לכרטיסים האמורים, או חסימת/מחיקת מידע בקשר להודעות, צפיות, חיוכים וכדו'. כל זאת ללא צורך במתן הנמקה או הודעה מראש.\n" +
                "4.\tחל איסור מוחלט לפתוח כרטיס מזויף באפליקציה, למעט שם בדוי. כל משתמש הפותח כרטיס מתחייב בזאת שכרטיס זה מייצג נאמנה אדם אמיתי. מובהר בזאת שעל המשתמש לצרף רק תמונה שלו המייצגת אותו נאמנה. החצי שלי שומרת לעצמה את הזכות לעשות התאמות טכניות במידה ויהיה צורך בכך, על מנת להתאים את התמונה לאפליקציה ולמשתמש לא תהא כל טענה או תביעה בקשר לכך.\n" +
                "5.\tלא ניתן לרשום שני משודכים על אותה כתובת מייל. ניתן לפתוח כרטיס לחבר או בן משפחה אך ורק בידיעתו ובהסכמתו המלאה.\n" +
                "6.\tהגלישה והשימוש באפליקציה מותרים מגיל 18 ומעלה, בהירשמך לאפליקציה הנך מצהיר שהנך מעל גיל 18.\n" +
                "7.\tחל איסור חמור על כל פרסום מסחרי באפליקציה או על כל פנייה למשתמשי האפליקציה שלא לצורך היכרות אישית בהתאם לתנאי ולאופי האפליקציה, או כל פעילות אחרת מטעם גוף מסחרי, אשר אינה לצורכי היכרות אישית בלבד. מבלי לגרוע מכל זכות או סעד לו זכאית ההנהלה, העובר על סעיף זה יחייב בתשלום של 10,000 ₪ ללא הוכחת נזק. המשתמש מצהיר הינו מוותר על זכותו לטעון טענה כלשהי כנגד גובהו של הסכום הנ\"ל.\n" +
                "8.\tחל איסור לשתול קודים או וירוסים או תוכנות באפליקציה מכל סיבה שהיא. כמו כן אסור לשלוח דואר זבל לחברי האפליקציה. ההתקשרות במערכת ההודעות של האפליקציה תיעשה רק לצורך הכרות אישית עם משתמשים אחרים שרשומים באפליקציה.\n" +
                "9.\tכל מאמר או חיבור או פרסום או אינפורמציה המתפרסמים באפליקציה בייחוד במערכת המאמרים של האפליקציה ע\"י משתמשים אחרים ואפילו ע\"י החצי שלי, לא יהיה בו משהו המחייב את בעלי האפליקציה בבדיקת אמינות המידע, כמו כן לא תהיה החצי שלי אחראית לכל נזק שייגרם במישרין או בעקיפין בעקבות הסתמכות על הנכתב במערכת המאמרים של האפליקציה או בכל מקום אחר באפליקציה.\n" +
                "10.\tבהירשמך לשירות הנך מסכים לכך שהחצי שלי רשאית, על פי שיקול דעתה, לאפשר למשתמשים, ואף לגביך, לקבל, לשלוח, להפיץ מודעות שאינן מודעות אישיות, על פי פילוח אשר מותאם לאותם משתמשים. בנוסף, בהירשמך לשירות הנך מסכים שהחצי שלי תמליץ/תשתף את כרטיסך עם משתמשים אחרים הרשומים לשירות, ולהיפך, כל זאת על פי שיקול דעתה הבלעדי, משתמש אשר אינו מעוניין בקבלת המלצות מערכת או מסרים כלליים באפשרותו לפנות לשירות הלקוחות בדרכים המקובלות ולבקש שלא לקבל פניות מעין אלו.\n" +
                "11.\tהחצי שלי אינה אחראית על המידע, התכנים והתמונות המתפרסמים באפליקציה ע\"י המשתמשים השונים. כמו כן, אין האפליקציה אחראית לכל נזק ישיר או עקיף שיגרם למשתמש האפליקציה או לצד שלישי כתוצאה מהתכנים או מהשימוש באפליקציה. וכמובן שאין החצי שלי אחראית על אמיתות הנתונים והאנשים הרשומים באפליקציה. כל ההתנהלות בין האנשים לא באחראיות החצי שלי. משתמשים אשר נתקלים במשתמש שמנצל לרעה את השימוש באפליקציה או פוגע במשתמשים אחרים או קטין, מתבקשים לעזור לנו להרחיק אותו מן האפליקציה.\n" +
                "12.\tהחצי שלי אינה אחראית על גרימת כל נזק או איבוד מידע שנוצר עקב שימוש בשירותי האפליקציה כגון שימוש בשירות הודעות, בתכנים או תמונות שבאפליקציה . \n" +
                "13.\tכל ההודעות העוברות באפליקציית החצי שלי, אינן מוצפנות. אם או במידה ויהיה צורך בכך הנהלת האפליקציה שומרת לעצמה את הזכות לקרוא הודעות כאלו ולעשות בהן שימוש לפי שיקול דעתה הבלעדי.\n" +
                "14.\tהחצי שלי אינה אחראית על הפרה של זכויות יוצרים של צד שלישי. כל משתמש שמעלה תמונה או מאמר למערכת האפליקציה הינו האחראי הבלעדי עליה. אין להעלות כל תוכן שאינך בעל הזכויות היוצרים בו ובפרט תמונות או מאמרים. המשתמש מתחייב כי יעלה לאפליקציה אך ורק תכנים או צילומים הרלוונטיים לצורך מטרות האפליקציה – היכרות אישית, ושיש לו עליהם זכויות יוצרים.\n" +
                "15.\tחל איסור על פרסום פרטים שאינם נכונים או דברים שעשויים לפגוע בשאר משתמשי האפליקציה. הנך מצהיר בזאת כי אתה מסכים שכל דבר שתפרסם או תשלח או תצרף או תעלה לאפליקציה הינם על אחריותך הבלעדית. אין ההנהלה אחראית על הזנת תכנים לא נכונים ע\"י משתמשי האפליקציה. \n" +
                "16.\tהאפליקציה שומרת לעצמה את הזכות לשנות את שאלון ההרשמה. כמו כן, תוכל החצי שלי לשנות כל דבר שקשור בקוד האפליקציה או בהצגתו למשתמש. אין האפליקציה אחראי לטעויות בהצגת הנתונים במידה וייווצרו בעקבות כך.\n" +
                "17.\tמשתמש הנרשם לשירות, מודע לכך שבעתיד ייפתח אתר מותאם באינטרנט ובה יופיע גם כרטיסו וכל התוכן המופיע עליו באפליקציה. החצי שלי שומרת לעצמה את הזכות לשווק את האפליקציה בכל אמצעי אלקטרוני שתחפוץ בו.\n" +
                "18.\tהחצי שלי משתמשת בפונקציה בו מופיעים תמונות של גולשים בעמוד הבית של האפליקציה (ניתן לבקש שלא להופיע בפונקציות אלו). כמו כן, משתמשים מסוימים יופיעו בתוצאות החיפוש גם למשתמשים שאינם רשומים עדיין לאפליקציה ומבצעים חיפוש. החצי שלי לא תהיה אחראית לנזק פגיעה עלבון או הפסד כלשהו שייגרם למשתמש קיים עקב שימוש בפונקציות אלה.\n" +
                "19.\tהחצי שלי תהא רשאית ליצור מאגר מידע המכיל נתונים שקיבלה מהמשתמשים,  ולצרף את המידע שקיבלה מהם למאגר מידע זה.\n" +
                "20.\tהחצי שלי רשאית לבחור את סדר הופעת משתמשים בתוצאות החיפוש או לבחור להציג משתמשים מסוימים בעמוד הבית בהתאם לשיקול דעתה. בהירשמך לאפליקציה, הנך מצהיר שאתה מסכים לעובדה זאת. \n" +
                "21.\tהחצי שלי אינה אחראית לזמינותו התמידית של האפליקציה, כמו כן, לא לתקלות טכניות שיהיו בו או למידע שיישמר באפליקציה, וכן, לשום נזק שיכול להיגרם מהפסקת הפעלת האפליקציה.\n" +
                "22.\tהנהלת החצי שלי תהיה רשאית לדרוש תשלום עבור שימוש באפליקציה בכל רגע נתון לפי שיקול דעתה הבלעדי.\n" +
                "23.\tהחצי שלי רשאית לפרסם פרסומות באפליקציה, בכל זמן שרק תחליט, לפי שיקול דעתה הבלעדי.\n" +
                "24.\tהנך מצהיר בזאת כי ידוע לך שאין שום התחייבות להצלחת האפליקציה, וכי תשלום המנוי אינו קשור להצלחה במציאת זיווג, אהבה, קשר או כל התקשרות כלשהי עם בני המין השני.\n" +
                "25.\tבהסכמתך לתקנון, הנך מאשר שקראת אותו ואתה מוותר על כל טענה נגד החצי שלי הן לגבי נזקים שעלולים להיגרם מפגישות עם משתמשים אחרים או מתוכן פוגע ומעליב. משתמשים נדרשים להיזהר מהמידע שהם משאירים בכרטיסי המשתמש שלהם. אין החצי שלי אחראית לנזק שיגרם למשתמשי האפליקציה בעקבות שימוש לרעה במידע שהם הזינו לכרטיס או למשתמשים אחרים.\n" +
                "\n" +
                "הנהלת החצי שלי מאחלת לך שימוש מהנה, ושתמצא את החצי שלך בקרוב!\n");
        txtDetails.setMovementMethod(new ScrollingMovementMethod());
    }

}
